<?php
/**
 *  试除法： 定义为只有1与该数本身两个因数的数
 * 
 * 筛选法：
 * 求出 1~n 的素数
 * 筛选法 ：
 * 1.求出 根号n
 * 2.求出 1~n 之前的素数
 * 3.删去 小于n的素数的倍数（小于n的素数的倍数保留）
 * 4.剩下的就是1~n的素数
 * 
 */
      $n=sqrt(100);
      for ($i=2; $i < 100; $i++) { 
          if ( ($i%2!=0 && $i%3!=0 && $i%5!=0 && $i%7!=0) || $i==2 || $i==3 || $i==5 || $i==7 ) {
              echo "$i ";
          }
      }
?>

<!-- <?php
    echo var_dump((float)false);


    // echo "<br/>";

    var_dump(0.1 == (1-0.9));

    var_dump(0.9 == (1-0.1));

    var_dump(1-0.1);

    var_dump(0.9 == 0.9);

?> -->